In [10]:
import pandas as pd
from pandas import Series, DataFrame

# 5.1 Introduction to pandas Data Structures

### Series

In [3]:
obj = pd.Series([4, 7, -5, 3])

created a Series

In [19]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

And so on...

In [11]:
obj.values

array([ 4,  7, -5,  3])

gives you value is Series

In [12]:
obj.index # like range(4)

RangeIndex(start=0, stop=4, step=1)

gives you index in Series

In [56]:
obj2 = pd.Series([4,7,-5,3]); index = ['d', 'b', 'a','c']

index identified for each value

In [57]:
obj2

0    4
1    7
2   -5
3    3
dtype: int64

In [31]:
obj2.index

RangeIndex(start=0, stop=4, step=1)

"""different output"""

In [ ]:
obj2['a']

In [37]:
obj2['d'] = 6

In [ ]:
obj2[['c', 'a', 'd']]

In [45]:
obj2[obj2 > 0]

0    4
1    7
3    3
d    6
dtype: int64

In [46]:
obj * 2

0     8
1    14
2   -10
3     6
d    12
dtype: int64

In [ ]:
np.exp(obj2)

In [ ]:
'b' in obj2

False

In [ ]:
'e' in obj2

False

In [ ]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [ ]:
obj3 = pd.Series(sdata)

In [ ]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [ ]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [ ]:
obj4 = pd.Series(sdata, index = states)

In [ ]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

pulled indexes from obj3 and placed in obj4

In [ ]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [ ]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

Series as instances

In [ ]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [ ]:
obj4.name = 'population'

In [ ]:
obj4.index.name = 'state'

In [ ]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

added 'state' as index name and named it with 'population'

In [ ]:
obj

0    4
1    7
2   -5
3    3
d    6
dtype: int64

In [ ]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

altered Series's Index

### DataFrame

In [71]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [72]:
frame = pd.DataFrame(data)

In [73]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [74]:
pd.DataFrame(data, columns=['year', 'state', 'pop',])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

columns arranged

In [76]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], 
                        index=['one', 'two', 'three', 'four', 'five', 'six'])

In [77]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN